{
    "class_name": "Functional",
    "config": {
        "name": "model",
        "trainable": true,
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [null, null, null, 88],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [1, 1],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "softsign",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999974752427e-07
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d",
                "inbound_nodes": [
                    [["input_1", 0, 0, {}]]
                ]
            },
            {
                "class_name": "SpatialDropout2D",
                "config": {
                    "name": "spatial_dropout2d",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.0001,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "spatial_dropout2d",
                "inbound_nodes": [
                    [["conv2d", 0, 0, {}]]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 3,
                    "kernel_size": [1, 1],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 9.999999974752427e-07
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d_1",
                "inbound_nodes": [
                    [["spatial_dropout2d", 0, 0, {}]]
                ]
            },
            {
                "class_name": "SpatialDropout2D",
                "config": {
                    "name": "spatial_dropout2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.0001,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "spatial_dropout2d_1",
                "inbound_nodes": [
                    [["conv2d_1", 0, 0, {}]]
                ]
            }
        ],
        "input_layers": [
            ["input_1", 0, 0]
        ],
        "output_layers": [
            ["spatial_dropout2d_1", 0, 0]
        ]
    },
    "keras_version": "2.13.1",
    "backend": "tensorflow"
}